# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [22]:
s1=pd.Series(np.random.randint(1,4,100))
s2=pd.Series(np.random.randint(1,3,100))
s3=pd.Series(np.random.randint(10000,30000,100))

In [23]:
pd.concat([s1,s2,s3])

0         2
1         1
2         1
3         2
4         2
      ...
95    21576
96    10369
97    12575
98    19263
99    17310
Length: 300, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [15]:
pd.concat([s1,s2,s3], axis=1)

    0  1      2
0   2  2  27913
1   2  2  22756
2   3  2  19754
3   3  1  10578
4   3  2  14532
.. .. ..    ...
95  1  2  21995
96  1  1  23482
97  2  1  11876
98  3  2  16976
99  3  1  28639

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [16]:
pd.concat([s1,s2,s3], axis=1 ,keys=['bedrs','bathrs','price_sqr_meter'])

    bedrs  bathrs  price_sqr_meter
0       2       2            27913
1       2       2            22756
2       3       2            19754
3       3       1            10578
4       3       2            14532
..    ...     ...              ...
95      1       2            21995
96      1       1            23482
97      2       1            11876
98      3       2            16976
99      3       1            28639

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [20]:
bigcolumn = pd.concat([s1,s2,s3], axis=0 )
bigcolumn.to_frame()

        0
0       2
1       2
2       3
3       3
4       3
..    ...
95  21995
96  23482
97  11876
98  16976
99  28639

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [21]:
bigcolumn = pd.concat([s1,s2,s3], axis=0 ,ignore_index=True)
bigcolumn.to_frame()

         0
0        2
1        2
2        3
3        3
4        3
..     ...
295  21995
296  23482
297  11876
298  16976
299  28639

[300 rows x 1 columns]